import type { CatBreedTranslation } from '@/types/cat'

export const catBreed: Record<string, CatBreedTranslation> = {
  'abys': {
    id: 'abys',
    nameJa: 'アビシニアン',
    descriptionJa: '毛の一本一本に縞模様が入っています。「イギリス兵がアビシニア高原（エチオピア）から連れ帰った珍しい猫」と紹介されたことに由来します。'
  },
  'aege': {
    id: 'aege', 
    nameJa: 'エーゲキャット',
    descriptionJa: '最も古い家畜化された猫種の1つと考えられています。ギリシャの自然発生的な猫種です。'
  },
  'abob': {
    id: 'abob',
    nameJa: 'アメリカンボブテイル',
    descriptionJa: '短いしっぽが特徴。アメリカではアニマル・セラピーに参加することもあり、「猫界のゴールデンレトリーバー」と呼ばれることもあるほど温和です。'
  },
  'acur': {
    id: 'acur',
    nameJa: 'アメリカンカール',
    descriptionJa: '外向きにカールした耳が大きな特徴です。性格はおとなしく人懐こいと言われています。'
  },
  'asho': {
    id: 'asho',
    nameJa: 'アメリカンショートヘア',
    descriptionJa: 'ネズミやヘビといった害獣駆除を目的に飼育されてきた歴史から運動能力が高いです。「アメショ」「アメショー」という略称で呼ばれることも多いです。'
  },
  'awir': {
    id: 'awir',
    nameJa: 'アメリカンワイヤーヘア',
    descriptionJa: '原産国はアメリカ。毛先が曲がった縮れ毛をしたアメリカンショートヘアの仔猫が突然変異で生まれたのが始まりです。'
  },
  'amau': {
    id: 'amau',
    nameJa: 'アラビアンマウ',
    descriptionJa: 'アラビア半島の砂漠に自生する短髪の在来種であるスナネコに由来する飼い猫の正式な品種です。'
  },
  'amis': {
    id: 'amis',
    nameJa: 'オーストラリアンミスト',
    descriptionJa: 'オーストラリアで開発された猫種です。毛は短めから中くらいの長さで、滑らかで絹のような手触りです。'
  },
  'bali': {
    id: 'bali',
    nameJa: 'バリニーズ',
    descriptionJa: 'シャム猫のうち突然変異で長毛の形質を表したものを、品種として固定したものです。目の色は淡いブルーからサファイア・ブルーないし紫まで差があります。'
  },
  'bamb': {
    id: 'bamb',
    nameJa: 'バンビーノ',
    descriptionJa: 'スフィンクスとマンチカンの交配種で無毛タイプの小さな猫です。名前はイタリア語で「赤ちゃん」を指しますが、その名の通りの柔らかそうな肌の質感をもつ猫です。'
  },
  'beng': {
    id: 'beng',
    nameJa: 'ベンガル',
    descriptionJa: '大きな体型にしては小さ目の頭部、ヒョウのような引き締まった体が特徴です。運動量が多いため、十分に運動できる環境で飼うのが望ましいとされています。',
  },
  'birm': {
    id: 'birm',
    nameJa: 'バーマン',
    descriptionJa: 'ミャンマー周辺原産と考えられているネコの一種です。最も特徴的なのは、白い手袋と靴下を履いたような四肢の先です。'
  },
  'bomb': {
    id: 'bomb',
    nameJa: 'ボンベイ',
    descriptionJa: 'バーミーズと黒毛のアメリカンショートヘアの交配から生まれました。黒い被毛と金色の目が特徴的です。'
  },
  'bslo': {
    id: 'bslo',
    nameJa: 'ブリティッシュロングヘア',
    descriptionJa: 'イングランド原産の猫種。ブリティッシュショートヘアを長毛種に改良して生まれた猫です。'
  },
  'bsho': {
    id: 'bsho',
    nameJa: 'ブリティッシュショートヘア',
    descriptionJa: '短毛種であり、骨太の脚、引き締まった胴体、重量感のある丸い顔が特徴的。元々は「ブリティッシュブルー」と呼ばれていました。'
  },
  'bure': {
    id: 'bure',
    nameJa: 'バーミーズ',
    descriptionJa: '体を構成する頭部、目、鼻などの各パーツは丸く、中型で筋肉質です。短毛で、とても綺麗好きです。'
  },
  'buri': {
    id: 'buri',
    nameJa: 'バーミラ',
    descriptionJa: 'チンチラペルシャとバーミーズの交配種です。輝く銀色の毛皮と、鼻、唇、目の周りの独特の「化粧」が特徴的です。'
  },
  'cspa': {
    id: 'cspa',
    nameJa: 'カリフォルニアスパングルド',
    descriptionJa: '長くて細身な胴体と小型レパードを思わせる斑点模様が特徴です。野生的な外見とは裏腹に遊び好きで人懐こく、愛情深くて社交的といわれます。'
  },
  'ctif': {
    id: 'ctif',
    nameJa: 'シャンティリー',
    descriptionJa: '首回りのたてがみのような毛と長いフワフワな尻尾、シルクのような美しい毛並みがエレガントな印象を与えます。おしゃべりなことでも知られています。'
  },
  'char': {
    id: 'char',
    nameJa: 'シャルトリュー',
    descriptionJa: 'ロシアンブルーおよびコラットと並びブルー（銀灰色）の御三家と称されています。羊毛のように密生したその被毛は水をよく弾きます。'
  },
  'chau': {
    id: 'chau',
    nameJa: 'チャウシー',
    descriptionJa: '胸が深く、横から見て長方形になる長い胴体に手足も長い、大柄な猫です。ヤマネコの血を引くためエネルギーに溢れています。'
  },
  'chee': {
    id: 'chee',
    nameJa: 'チートー',
    descriptionJa: 'オシキャットとベンガル猫を掛け合わせて生まれました。チーターによく似た模様が特徴的です。'
  },
  'csho': {
    id: 'csho',
    nameJa: 'カラーポイントショートヘア',
    descriptionJa: 'シャムとアメリカンショートヘアーなどの交配によって生み出された品種。声の大きさはシャム譲りで、常に注目の中心にいたがる傾向があります。'
  },
  'crex': {
    id: 'crex',
    nameJa: 'コーニッシュレックス',
    descriptionJa: 'シングルコートの巻き毛が特徴のやや小さ目の猫です。無駄のない筋肉がついており、素晴らしいジャンプ力を見せます。'
  },
  'cymr': {
    id: 'cymr',
    nameJa: 'キムリック',
    descriptionJa: 'カナダ原産でマンクスに長毛種をかけ合わせてできた猫です。前肢より後肢の方が長く、モコモコしたぬいぐるみのような毛が特徴です。'
  },
  'cypr': {
    id: 'cypr',
    nameJa: 'キプロスキャット',
    descriptionJa: 'キプロス島全域で見られる飼い猫の在来種です。やや毛が厚く、運動能力が高く活発な種類です。'
  },
  'drex': {
    id: 'drex',
    nameJa: 'デボンレックス',
    descriptionJa: '飼い主の肩に乗るのが大好きな猫種です。好奇心旺盛で、家での活動に積極的に参加します。'
  },
  'dons': {
    id: 'dons',
    nameJa: 'ドンスコイ',
    descriptionJa: 'スフィンクスと同様、無毛のネコです。ネコの中では例外的に体中に汗腺を持ち全身に汗をかきます。'
  },
  'lihu': {
    id: 'lihu',
    nameJa: 'ドラゴンリー',
    descriptionJa: '中国の飼い猫の品種です。金茶色のトラ模様、特徴的な耳の先端、力強くてがっしりとした体格をしています。'
  },
  'emau': {
    id: 'emau',
    nameJa: 'エジプシャンマウ',
    descriptionJa: '優しく控えめな性格です。飼い主を深く愛する一方で、見知らぬ人には警戒心を示します。'
  },
  'ebur': {
    id: 'ebur',
    nameJa: 'ヨーロピアンバーミーズ',
    descriptionJa: '丸顔のアメリカンバーミーズに比べて、顔はゆるやかな逆V型、やや釣り目でシャープな印象の顔立ちと、足がやや長いことが特徴です。'
  },
  'esho': {
    id: 'esho',
    nameJa: 'エキゾチックショートヘア',
    descriptionJa: 'ペルシャ猫の短毛種として開発された猫種です。短頭種であり、鼻と目が互いに近接しています。'
  },
  'hbro': {
    id: 'hbro',
    nameJa: 'ハバナブラウン',
    descriptionJa: 'チョコレートポイントのシャム猫と、シャムの血を持つ黒猫を交配された猫種。名前の由来はハバナ産の葉巻に似ているからと言われています。'
  },
  'hima': {
    id: 'hima',
    nameJa: 'ヒマラヤン',
    descriptionJa: 'ペルシャ猫とシャム猫を掛け合わせて作られた猫種。色模様が、ヒマラヤウサギに似ていることから名付けられたとされます。'
  },
  'jbob': {
    id: 'jbob',
    nameJa: 'ジャパニーズボブテイル',
    descriptionJa: 'いわゆる日本猫にその起源を有する、猫の一品種。丸まったその短い尻尾を最たる特徴としています。'
  },
  'java': {
    id: 'java',
    nameJa: 'ジャバニーズ',
    descriptionJa: 'シャム猫のうち突然変異で長毛の形質を表したものを、品種として固定したもの。ボディーは円筒形で、首、四肢、尾、すべてが長く細いです。'
  },
  'khao': {
    id: 'khao',
    nameJa: 'カオマニー',
    descriptionJa: '非常に賢く、外向的で好奇心旺盛です。同時に穏やかでリラックスした性格で、理想的な膝猫です。'
  },
  'kora': {
    id: 'kora',
    nameJa: 'コラット',
    descriptionJa: '筋肉が発達した丸みのある猫で、銀青色（シルバーブルー）の被毛から「銀色の猫」と形容されます。'
  },
  'kuri': {
    id: 'kuri',
    nameJa: 'クリリアンボブテイル',
    descriptionJa: 'ロシア原産の猫種で、活発かつ社交的な猫種です。ふわふわとした被毛を持っており、とても賢い猫種としても知られています。'
  },
  'lape': {
    id: 'lape',
    nameJa: 'ラパーマ',
    descriptionJa: 'まつ毛や尻尾、ヒゲなどまで全身を覆う縮れた毛が特徴。筋肉質で骨格もしっかりしており、厚い胸板と力強い四肢を持っています。'
  },
  'mcoo': {
    id: 'mcoo',
    nameJa: 'メインクーン',
    descriptionJa: '大きな体格と長い毛並みが特徴的です。適応力があり賢く、優しい性格で「ジェントルジャイアント」と呼ばれています。'
  },
  'manx': {
    id: 'manx',
    nameJa: 'マンクス',
    descriptionJa: 'イギリスのマン島を発祥とする尻尾の無いネコの品種です。尻尾が無いこと、そして顔の丸さから全体的に丸っこい印象を与えています。'
  },
  'munc': {
    id: 'munc',
    nameJa: 'マンチカン',
    descriptionJa: '世界一小さな体高の猫としてギネスブックに登録されたことがあります。短い足にも関わらず、素早く動き回ることができます。'
  },
  'nebe': {
    id: 'nebe',
    nameJa: 'ネベロング',
    descriptionJa: 'ロシアンブルーと共通点が多いことから「長毛のロシアンブルー」とも呼ばれています。キラキラと輝く絹のような被毛が特徴です。'
  },
  'norw': {
    id: 'norw',
    nameJa: 'ノルウェージャンフォレストキャット',
    descriptionJa: '原産地域の寒冷気候への自然適合として起こった非常に古い種類の猫です。大型種で、四肢は太くがっしりとした体格です。'
  },
  'ocic': {
    id: 'ocic',
    nameJa: 'オシキャット',
    descriptionJa: 'アビシニアン、シャム、アメリカンショートヘアを交配して生まれた品種です。ヒョウ柄が特徴的です。'
  },
  'orie': {
    id: 'orie',
    nameJa: 'オリエンタル',
    descriptionJa: '祖先はシャムです。ショートヘアとロングヘアの2つの種類があります。くさび形の頭、細くしなやかな胴、長い四肢と、ムチのような尾が特徴です。'
  },
  'pers': {
    id: 'pers',
    nameJa: 'ペルシャ',
    descriptionJa: 'イラン原産。長毛種の代表的な品種で、古くからショーキャットで認められる品種の一つです。つぶれた鼻が特徴的です。'
  },
  'pixi': {
    id: 'pixi',
    nameJa: 'ピクシーボブ',
    descriptionJa: '北アメリカのボブキャットに似るように交配された完全な家猫です。毛の柄はトラ模様で赤毛が混ざっていることが多いです。'
  },
  'raga': {
    id: 'raga',
    nameJa: 'ラガマフィン',
    descriptionJa: 'ラグドールとペルシャ系の種を掛け合わせて作出されました。ネコのテディベアとも呼ばれます。'
  },
  'ragd': {
    id: 'ragd',
    nameJa: 'ラグドール',
    descriptionJa: 'ふさふさとした白く長い毛とブルーの瞳が印象的です。「ぬいぐるみ人形」という意味をもつほど、おだやかで人に抱かれるのが大好きな猫です。'
  },
  'rblu': {
    id: 'rblu',
    nameJa: 'ロシアンブルー',
    descriptionJa: '猫の中でも、主人に忠実な性格を持つことから「犬のような」性格の猫だと言われます。短毛種であり、毛の色はブルーです。'
  },
  'sava': {
    id: 'sava',
    nameJa: 'サバンナ',
    descriptionJa: 'サーバルキャットとイエネコを交配して開発されたハイブリッド猫の一種です。一般的な猫とは違い、水を怖がらない子も多いそうです。'
  },
  'sfol': {
    id: 'sfol',
    nameJa: 'スコティッシュフォールド',
    descriptionJa: 'スコットランドで発見された、突然変異した猫の個体から発生。折れ曲がった独特の耳が、何よりも際立った特徴とされます。'
  },
  'srex': {
    id: 'srex',
    nameJa: 'セルカークレックス',
    descriptionJa: 'コーニッシュレックス、デボンレックスらレックス三種の中でも最も新しい種類。短毛種と長毛種があり、巻き毛が最大の特徴です。'
  },
  'siam': {
    id: 'siam',
    nameJa: 'シャム',
    descriptionJa: '王室などの家系でのみ飼うことが許されるなど、尊い扱いをうけてきました。ポインテッドと呼ばれる鼻先や足先だけに色がある毛柄が特徴。'
  },
  'sibe': {
    id: 'sibe',
    nameJa: 'サイベリアン',
    descriptionJa: '名前は「シベリアの猫」を意味する。長毛であり、3層目のガードへアを持つ個体も多く存在しているため、猫の中では唯一のトリプルコートと言われます。'
  },
  'sing': {
    id: 'sing',
    nameJa: 'シンガプーラ',
    descriptionJa: '小型のネコであることから、小さな妖精とも呼ばれます。短毛種で、絹のように細い毛はつややかな触り心地です。'
  },
  'snow': {
    id: 'snow',
    nameJa: 'スノーシュー',
    descriptionJa: 'アメリカで生まれた珍しい飼い猫の品種です。シャムの血を引いており、毛色は靴下を履いたように4本とも白くなっていることがあります。'
  },
  'soma': {
    id: 'soma',
    nameJa: 'ソマリ',
    descriptionJa: '原種はアビシニアンで、アビシニアンの長毛種とも言われます。長い体毛と狐のようなふさふさとした尾が特徴で、体格はアビシニアンと同じく筋肉質です。'
  },
  'sphy': {
    id: 'sphy',
    nameJa: 'スフィンクス',
    descriptionJa: '無毛のネコとして知られますが、まったくの無毛ではなく極めて短い産毛に覆われています。まばらに毛が生えている個体も存在します。ヒゲはありません。'
  },
  'tonk': {
    id: 'tonk',
    nameJa: 'トンキニーズ',
    descriptionJa: 'シャムとバーミーズを交配させて生まれた品種。筋肉質な体と毛の手触りから、抱き上げた時に「ミンクのコートを抱えたようだ」と形容されます。'
  },
  'toyg': {
    id: 'toyg',
    nameJa: 'トイガー',
    descriptionJa: '被毛の色と太いストライプ模様は、他の猫種にはないため大変珍しく、計画育種によって生み出されたこともあり「デザイナーズキャット」ともいわれています。'
  },
  'tang': {
    id: 'tang',
    nameJa: 'ターキッシュアンゴラ',
    descriptionJa: 'トルコの山岳地帯における自然発生種の猫の一品種。被毛は繊細で、絹のように光沢があり、非常に柔らかく手触りが良いシングルコートです。'
  },
  'tvan': {
    id: 'tvan',
    nameJa: 'ターキッシュバン',
    descriptionJa: 'トルコを原産地とする猫の一品種。水の中で遊ぶことを特に好むため、「ターキッシュ・スイミングキャット」「トルコの泳ぐネコ」とも呼ばれます。'
  },
  'ycho': {
    id: 'ycho',
    nameJa: 'ヨークチョコレート',
    descriptionJa: '名前は繁殖が開始された地域である「ニューヨーク」からヨークを取り、その毛色の「チョコレート色」と合わせて名付けられています。'
  }
}